src/config/Documents/ЗаданиеНаЗаказПоставщику.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ЗаданиеНаЗаказПоставщику</Name>
			<BasedOn>
				<xr:Item>Document.ЗаказПокупателяСезонный</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСогласования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Согласован</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаказПокупателяСезонный</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателяСезонный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Завод</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/config/Documents/ЗаданиеНаЗаказПоставщику/Ext/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПокупателяСезонный") Тогда
		ТоварыЗаказ = ДанныеЗаполнения.Товары.выгрузить();
		ТоварыЗаказ.Свернуть("Завод");
		Если ТоварыЗаказ.Количество()>1 тогда
			Сообщить("Недопускается создание задания на заказ поставщику, если в заказе несколько заводов");
			Возврат;
		КонецЕсли;
		// Заполнение шапки
		Контрагент = ДанныеЗаполнения.Контрагент;
		ЗаказПокупателяСезонный = ДанныеЗаполнения.Ссылка;
		ДатаСогласования = ТекущаяДата()+14*24*60*60;
		Для Каждого ТекСтрокаТовары Из ДанныеЗаполнения.Товары Цикл
			НоваяСтрока = Товары.Добавить();
			НоваяСтрока.Завод = ТекСтрокаТовары.Завод;
			НоваяСтрока.Количество = ТекСтрокаТовары.Количество;
			НоваяСтрока.Номенклатура = ТекСтрокаТовары.Номенклатура;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	Если не рольДоступна("ПравоЗавершенияРаботыПользователей") тогда
		Сообщить("У вас нет прав для удаление задания.");
		отказ = истина;
	КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	//+++ Шарафутдинов 23.04.2018 по задаче 45625 
	
	//записывать можно всем
	
	//Если не рольДоступна("ПравоЗавершенияРаботыПользователей") 
	//	и не СокрЛП(глТекущийПользователь.Код) = "Малышев Егор" 
	//	и не СокрЛП(глТекущийПользователь.Код) = "Гугунишвили О. Г."
	//	и не СокрЛП(глТекущийПользователь.Код) = "Жарикова В."
	//	и не СокрЛП(глТекущийПользователь.Код) = "Вострилов А.В."
	//	и не СокрЛП(глТекущийПользователь.Код) = "Ильина Н.В.(ВЭД)"
	//	и не СокрЛП(глТекущийПользователь.Код) = "Доколин"
	//	и не СокрЛП(глТекущийПользователь.Код) = "Сухачева А.В."
	//	и не СокрЛП(глТекущийПользователь.Код) = "Голубева В.С." Тогда
	//	Сообщить("У вас нет прав для записи задания.");
	//	отказ = истина;
	//КонецЕсли;
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение или РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения тогда
		Если не рольДоступна("ПравоЗавершенияРаботыПользователей") 
			и не СокрЛП(глТекущийПользователь.Код) = "Бондаренко Е.Д. (снабжение)" 
			и не СокрЛП(глТекущийПользователь.Код) = "Ильина Н.В."
			и не СокрЛП(глТекущийПользователь.Код) = "Жарикова В."
			и не СокрЛП(глТекущийПользователь.Код) = "Малышев Егор"  
			и не СокрЛП(глТекущийПользователь.Код) = "Захаров В.В. (снабжение)" // № 53095 
			тогда
			Сообщить("У вас нет прав для проведения задания.");
			отказ = истина;
		КонецЕсли;	
	КонецЕсли;
		
	
	
	//--- Шарафутдинов 23.04.2018 по задаче 45625 
	
КонецПроцедуры
